In [ ]:


# 3- ¿Cuántos ataques hubo por año y sexo? Devolved un DataFrame solo del año 2000 en adelante.
# 4- Primero extraed solo las filas que correspondan a USA, AUSTRALIA y SOUTH AFRICA. ¿Cuántos de los ataques fueron letales por sexo? Devuelve un DataFrame.
# 5- Usando el DataFrame creado en el ejercicio anterior. ¿En qué país hubo más ataques?
# 6- ¿Qué y cuántos tipos de ataques hubo por país?

In [1]:
# 1- ¿Cuántos ataques hubo por país? Devuelve un DataFrame.

import pandas as pd

df=pd.read_csv('./attacks_pandas5.csv')

In [9]:
#CON VALUE COUNTS:
ataques_pais=df['Country'].value_counts()
ataques_pais

USA                   741
AUSTRALIA             343
SOUTH AFRICA          234
BAHAMAS                29
NEW ZEALAND            21
                     ...
GREENLAND               1
ST. MAARTIN             1
UNITED KINGDOM          1
SWEDEN                  1
CEYLON (SRI LANKA)      1
Name: Country, Length: 95, dtype: int64

In [15]:
atacks=pd.DataFrame(ataques_pais)
atacks

                    Country
USA                     741
AUSTRALIA               343
SOUTH AFRICA            234
BAHAMAS                  29
NEW ZEALAND              21
...                     ...
GREENLAND                 1
ST. MAARTIN               1
UNITED KINGDOM            1
SWEDEN                    1
CEYLON (SRI LANKA)        1

[95 rows x 1 columns]

In [47]:
df.columns

Index(['Case Number', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex', 'Age', 'Time', 'Species', 'Href', 'Siglo',
       'Unnamed: 0_x', 'Sex ', 'Species ', 'href', 'Unnamed: 0_y',
       'Fatal (Y/N)', 'Injury', 'Date'],
      dtype='object')

In [24]:
# CON GROUPBY:
ataques_country=df.groupby('Country')['Country'].count()

In [26]:
atacks_country=pd.DataFrame(ataques_country)
atacks_country

                Country
Country
AMERICAN SAMOA        2
ARGENTINA             1
ASIA?                 1
AUSTRALIA           343
BAHAMAS              29
...                 ...
URUGUAY               2
USA                 741
VANUATU               4
VENEZUELA             4
VIETNAM               5

[95 rows x 1 columns]

In [48]:
# 2- ¿Cuántos ataques ha habido por año? Devuelve un DataFrame. De nuevo ordena los resultados de mayor a menor.
import numpy as np
ataques_años=df.groupby('Year')['Date'].count() 

ataques_años

Year
0.0       125
5.0         1
77.0        1
500.0       1
1543.0      1
         ...
2014.0     35
2015.0     68
2016.0     37
2017.0     30
2018.0     17
Name: Date, Length: 147, dtype: int64

In [49]:
attacks_años=pd.DataFrame(ataques_años)

In [50]:
attacks_años.sort_values(by=['Date'])

        Date
Year
1784.0     1
1779.0     1
1780.0     1
1783.0     1
1785.0     1
...      ...
2002.0    53
2012.0    54
2007.0    57
2015.0    68
0.0      125

[147 rows x 1 columns]

In [53]:
attacks_años.rename(columns={'Date':'Ataques'}, inplace= True)
attacks_años

        Ataques
Year
0.0         125
5.0           1
77.0          1
500.0         1
1543.0        1
...         ...
2014.0       35
2015.0       68
2016.0       37
2017.0       30
2018.0       17

[147 rows x 1 columns]